loadtest/Chat_loadtest.yml
config:
  target: 'http://localhost'
  processor: './chat-helpers.js'

  socketio:
    path: '/chat'
    transports: ['websocket']

  # 평균 세션 지속 시간 ~8.5초 기준
  # Sustained 30/s → ~255 concurrent (MAX_CLIENTS 500 이내)
  # Spike    60/s → ~510 concurrent (MAX_CLIENTS 500 초과 — 의도적 한계 테스트)
  phases:
    - duration: 30
      arrivalRate: 5
      name: 'Warm-up'

    - duration: 60
      arrivalRate: 5
      rampTo: 30
      name: 'Ramp-up'

    - duration: 120
      arrivalRate: 30
      name: 'Sustained'

    - duration: 30
      arrivalRate: 60
      name: 'Spike (MAX_CLIENTS 500 초과 구간)'

    - duration: 30
      arrivalRate: 10
      name: 'Cool-down'

  variables:
    chatMessages:
      - '안녕하세요!'
      - '오늘 날씨가 좋네요'
      - '개발 잘 되고 계신가요?'
      - 'NestJS 정말 좋더라고요'
      - 'TypeScript 만세!'
      - '리뷰 부탁드립니다'
      - '버그 잡는 중입니다'
      - '화이팅!'
      - '새로운 기능 추가했어요'
      - '테스트 코드 작성 중'
      - '배포 완료!'
      - 'PR 리뷰 남겼습니다'
      - '코드 리뷰 해주세요'
      - '오늘도 열심히!'
      - '슬랙 확인했어요'

scenarios:
  # ── 시나리오 1: 일반 채팅 사용자 ───────────────────────────────────────────
  # 신규 등록 후 동일 userId로 메시지 5회 전송
  # 평균 세션: ~10s | 비중: 40%
  - name: '일반 채팅 사용자'
    weight: 40
    engine: 'socketio'
    flow:
      - function: 'generatePersistentUserId'

      - emit:
          channel: 'register'
          data:
            userId: '{{ persistentUserId }}'

      - think: 2

      - loop:
          - emit:
              channel: 'message'
              data:
                messageId: '{{ $uuid }}'
                userId: '{{ persistentUserId }}'
                message: '{{ chatMessages }}'

          - think: 1.5

        count: 5

  # ── 시나리오 2: 채팅 관찰자 (Lurker) ──────────────────────────────────────
  # 연결 후 chatHistory만 수신하고 메시지는 보내지 않음
  # 평균 세션: ~10s | 비중: 25%
  - name: '채팅 관찰자'
    weight: 25
    engine: 'socketio'
    flow:
      - function: 'generatePersistentUserId'

      - emit:
          channel: 'register'
          data:
            userId: '{{ persistentUserId }}'

      - think: 10

  # ── 시나리오 3: 빠른 채팅 사용자 ──────────────────────────────────────────
  # 짧은 간격으로 다량의 메시지 전송 — Redis LPUSH/LTRIM 집중 부하
  # 평균 세션: ~6s | 비중: 20%
  - name: '빠른 채팅 사용자'
    weight: 20
    engine: 'socketio'
    flow:
      - function: 'generatePersistentUserId'

      - emit:
          channel: 'register'
          data:
            userId: '{{ persistentUserId }}'

      - think: 0.5

      - loop:
          - emit:
              channel: 'message'
              data:
                messageId: '{{ $uuid }}'
                userId: '{{ persistentUserId }}'
                message: '{{ chatMessages }}'

          - think: 0.5

        count: 10

  # ── 시나리오 4: 재연결 사용자 ─────────────────────────────────────────────
  # 같은 소켓에서 동일 userId로 register 재호출 (페이지 새로고침 시뮬레이션)
  # getOrCreateUserName: Redis 캐시 히트 경로를 집중 테스트
  # 평균 세션: ~9s | 비중: 10%
  - name: '재연결 사용자'
    weight: 10
    engine: 'socketio'
    flow:
      - function: 'generatePersistentUserId'

      - emit:
          channel: 'register'
          data:
            userId: '{{ persistentUserId }}'

      - think: 1

      - emit:
          channel: 'message'
          data:
            messageId: '{{ $uuid }}'
            userId: '{{ persistentUserId }}'
            message: '연결 초기 메시지'

      - think: 3

      # 동일 userId로 재등록 → assignUserId 이벤트 발생하지 않아야 함
      - emit:
          channel: 'register'
          data:
            userId: '{{ persistentUserId }}'

      - think: 1

      - emit:
          channel: 'message'
          data:
            messageId: '{{ $uuid }}'
            userId: '{{ persistentUserId }}'
            message: '재연결 후 메시지'

      - think: 2

  # ── 시나리오 5: 유효성 검사 오류 케이스 ────────────────────────────────────
  # 빈 메시지, 잘못된 UUID 전송 후 정상 복구 확인
  # ws.exception.filter → error_chat 이벤트 처리 경로 테스트
  # 평균 세션: ~3s | 비중: 5%
  - name: '유효성 검사 오류 케이스'
    weight: 5
    engine: 'socketio'
    flow:
      - function: 'generatePersistentUserId'

      - emit:
          channel: 'register'
          data:
            userId: '{{ persistentUserId }}'

      - think: 0.5

      # 빈 메시지 → VALIDATION_ERROR (error_chat 이벤트 기대)
      - emit:
          channel: 'message'
          data:
            messageId: '{{ $uuid }}'
            userId: '{{ persistentUserId }}'
            message: ''

      - think: 0.5

      # 잘못된 messageId 형식 → VALIDATION_ERROR (error_chat 이벤트 기대)
      - emit:
          channel: 'message'
          data:
            messageId: 'not-a-uuid'
            userId: '{{ persistentUserId }}'
            message: '잘못된 messageId 테스트'

      - think: 0.5

      # 정상 메시지로 복구 → 서버가 오류 후 정상 처리하는지 확인
      - emit:
          channel: 'message'
          data:
            messageId: '{{ $uuid }}'
            userId: '{{ persistentUserId }}'
            message: '오류 후 정상 복구 확인'